In [3]:
import pandas as pd
d=pd.read_csv("income.csv")
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [5]:
d.loc[0:]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [6]:
d[["2010"]]

    2010
0  40933
1  57848
2  46896
3  38587
4  54283

In [12]:
s=0
for i in d["2010"]:
    s=s+i
print(s)

238547

In [13]:
# to find the sum of particular column
d.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

In [15]:
s=0
for i in d.iloc[1,2:]:
    s=s+i
print(s)

540959

In [17]:
d["2010"].sum()

238547

In [22]:
## 4th row and all columns sum
s=0
for i in d.iloc[4,2:]:
     s=s+i
print(s)

498154

In [24]:
d.iloc[4,2:].sum()

498154

In [34]:
## sum of 2005 to 2008 columns
d.iloc[0:4,2:6].sum()

2005    174944
2006    178084
2007    208993
2008    194965
dtype: int64

In [35]:
d.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [37]:
a=d[["2005","2006","2007","2008"]].sum()
a.sum()

976808

In [38]:
d.iloc[:,2:11].sum()

2005    226699
2006    233403
2007    264727
2008    251979
2009    239995
2010    238547
2011    243311
2012    250194
2013    250567
dtype: int64

In [40]:
a=d[["2005","2006","2007","2008","2009","2010","2011","2012","2013"]].sum()
a.sum()

2199422

In [41]:
d.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 62993, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [42]:
d.sum() # to find the total sum of individual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [43]:
d.sum(1) # to find the total sum of individual rows

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [59]:
# prod to find the product
a=d.iloc[1:2,2:6].prod()
 #a.prod()
a

2005    55891
2006    56418
2007    62993
2008    63989
dtype: int64

In [65]:
# prod to find the product
a=d.iloc[1:2,2:6].prod().prod()
a

-5736403676770409890

In [62]:
help(d.iloc)

Help on _iLocIndexer in module pandas.core.indexing object:

class _iLocIndexer(_LocationIndexer)
 |  Purely integer-location based indexing for selection by position.
 |
 |  ``.iloc[]`` is primarily integer position based (from ``0`` to
 |  ``length-1`` of the axis), but may also be used with a boolean
 |  array.
 |
 |  Allowed inputs are:
 |
 |  - An integer, e.g. ``5``.
 |  - A list or array of integers, e.g. ``[4, 3, 0]``.
 |  - A slice object with ints, e.g. ``1:7``.
 |  - A boolean array.
 |  - A ``callable`` function with one argument (the calling Series, DataFrame
 |    or Panel) and that returns valid output for indexing (one of the above).
 |    This is useful in method chains, when you don't have a reference to the
 |    calling object, but would like to base your selection on some value.
 |
 |  ``.iloc`` will raise ``IndexError`` if a requested indexer is
 |  out-of-bounds, except *slice* indexers which allow out-of-bounds
 |  indexing (this conforms with python/numpy *slice* semantics).
 |
 |  See more at ref:`Selection by Position <indexing.integer>`.
 |
 |  See Also
 |  --------
 |  DataFrame.iat : Fast integer location scalar accessor.
 |  DataFrame.loc : Purely label-location based indexer for selection by label.
 |  Series.iloc : Purely integer-location based indexing for
 |                 selection by position.
 |
 |  Examples
 |  --------
 |
 |  >>> mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 |  ...           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 |  ...           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
 |  >>> df = pd.DataFrame(mydict)
 |  >>> df
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  **Indexing just the rows**
 |
 |  With a scalar integer.
 |
 |  >>> type(df.iloc[0])
 |  <class 'pandas.core.series.Series'>
 |  >>> df.iloc[0]
 |  a    1
 |  b    2
 |  c    3
 |  d    4
 |  Name: 0, dtype: int64
 |
 |  With a list of integers.
 |
 |  >>> df.iloc[[0]]
 |     a  b  c  d
 |  0  1  2  3  4
 |  >>> type(df.iloc[[0]])
 |  <class 'pandas.core.frame.DataFrame'>
 |
 |  >>> df.iloc[[0, 1]]
 |       a    b    c    d
 |  0    1    2    3    4
 |  1  100  200  300  400
 |
 |  With a `slice` object.
 |
 |  >>> df.iloc[:3]
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  With a boolean mask the same length as the index.
 |
 |  >>> df.iloc[[True, False, True]]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  With a callable, useful in method chains. The `x` passed
 |  to the ``lambda`` is the DataFrame being sliced. This selects
 |  the rows whose index label even.
 |
 |  >>> df.iloc[lambda x: x.index % 2 == 0]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  **Indexing both axes**
 |
 |  You can mix the indexer types for the index and columns. Use ``:`` to
 |  select the entire axis.
 |
 |  With scalar integers.
 |
 |  >>> df.iloc[0, 1]
 |  2
 |
 |  With lists of integers.
 |
 |  >>> df.iloc[[0, 2], [1, 3]]
 |        b     d
 |  0     2     4
 |  2  2000  4000
 |
 |  With `slice` objects.
 |
 |  >>> df.iloc[1:3, 0:3]
 |        a     b     c
 |  1   100   200   300
 |  2  1000  2000  3000
 |
 |  With a boolean array whose length matches the columns.
 |
 |  >>> df.iloc[:, [True, False, True, False]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  With a callable function that expects the Series or DataFrame.
 |
 |  >>> df.iloc[:, lambda df: [0, 2]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  Method resolution order:
 |      _iLocIndexer
 |      _LocationIndexer
 |      _NDFrameIndexer
 |      pandas._libs.indexing._NDFrameIndexerBase
 |      builtins.object
 |
 |  Methods inherited from _LocationIndexer:
 |
 |  __getitem__(self, key)
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from _NDFrameIndexer:
 |
 |  __call__(self, axis=None)
 |      Call self as a function.
 |
 |  __iter__(self)
 |
 |  __setitem__(self, key, value)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _NDFrameIndexer:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _NDFrameIndexer:
 |
 |  axis = None
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __reduce__ = __reduce_cython__(...)
 |
 |  __setstate__ = __setstate_cython__(...)
 |
 |  ----------------------------------------------------------------------
 |  Static methods inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  name
 |
 |  ndim
 |
 |  obj

In [102]:
# mean() to find the average
# find the avg of 2011 column
# find the avg of 2nd row
print(d["2011"].mean())
print(d.iloc[2,2:].mean())

48662.2
48967.88888888889

In [103]:
##median
print(d["2011"].median())
print(d.iloc[2,2:].median())

48621.0
46914.0

In [112]:
d=pd.read_csv("income.csv",index_col="State")
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

## 1.Combined Average Income of all states from 2005 to 2013

In [134]:
d.iloc[0:,2:].mean().mean()

49402.299999999996

## 2.State with highest average income in the last three years

In [135]:
d.iloc[:,-3:].mean(1) # row wise average of last three years

State
Alabama       41901.75
Alaska        61764.75
Arizona       49712.50
Arkansas      39693.75
California    57401.00
dtype: float64

In [136]:
d["last three years avg"]=d.iloc[0:,-3:].mean(1)
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years,last three years avg
State,,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,NaN,41901.75
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,NaN,61764.75
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,NaN,49712.50
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,NaN,39693.75
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,NaN,57401.00

In [137]:
d["last three years avg"]==max(d["last three years avg"]) # boolean masking

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: last three years avg, dtype: bool

In [140]:
d[d["last three years avg"]==max(d["last three years avg"])].index[0]

'Alaska'

In [146]:
d.iloc[:,-3:].mean(1).idxmax()

'Alaska'

## 3.State with lowest average income from 2007 to 2010(inclusive)

In [147]:
d.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

## 4.Print the list of all states in the same line with average income less than California

In [150]:
a=d.iloc[:,2:].mean(1)
a

State
Alabama       41654.416667
Alaska        60759.194444
Arizona       49464.277778
Arkansas      39166.194444
California    55977.777778
dtype: float64

In [152]:
calavg=d.iloc[-1,2:].mean()
calavg

55977.77777777778

In [154]:
list(d[d.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

## 5.Print the names of states based on descending order of income in the year 2009

In [166]:
a=d.iloc[:,5]
a

State
Alabama       39980
Alaska        61604
Arizona       45739
Arkansas      36538
California    56134
Name: 2009, dtype: int64

In [167]:
b=a.sort_values(ascending=False)
b

State
Alaska        61604
California    56134
Arizona       45739
Alabama       39980
Arkansas      36538
Name: 2009, dtype: int64

In [164]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

## 6.State with the lowest recorded income from 2005 to 2013'''

In [170]:
d.iloc[:,1:].idxmin()

2005                    Arkansas
2006                    Arkansas
2007                    Arkansas
2008                    Arkansas
2009                    Arkansas
2010                    Arkansas
2011                    Arkansas
2012                    Arkansas
2013                    Arkansas
last three years             NaN
last three years avg    Arkansas
dtype: object